podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SIM_MKM33ZA5.svd.xml
            <register>
               <name>SDID</name>
               <description>System Device Identification Register</description>
               <addressOffset>0x1024</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PINID</name>
                     <description>Pincount Identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>16-pin</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>24-pin</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>32-pin</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>Reserved</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>48-pin</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>64-pin</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>80-pin</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>Reserved</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>100-pin</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>Reserved</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1010</name>
                           <description>Reserved</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1011</name>
                           <description>Reserved</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1100</name>
                           <description>Reserved</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1101</name>
                           <description>Reserved</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1110</name>
                           <description>Reserved</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111</name>
                           <description>Reserved</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIEID</name>
                     <description>Die ID\n
Marks the change in Base Layer</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>First cut</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REVID</name>
                     <description>Revision ID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>Second Cut</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAMSIZE</name>
                     <description>SRAM Size</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>0.5 KB</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>1 KB</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>2 KB</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>4 KB</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>8 KB</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>16kB SRAM</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>32 KB</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>64 KB</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ATTR</name>
                     <description>System SRAM Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>M0+ core</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SERIESID</name>
                     <description>Kinetis Series ID</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>MKM - Metering Series</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SUBFAMID</name>
                     <description>Kinetis Sub-Family ID</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>MKMx2 Subfamily (Device derivatives with 2 AFE enabled)</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>MKMx3 Subfamily (Device derivatives with 3 AFE enabled)</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>MKMx4 Subfamily (Device derivatives with 4 AFE enabled)</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FAMID</name>
                     <description>Kinetis family ID</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>MKM1x Family (Without segment LCD)</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>MKM3x Family (Segment LCD)</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCGC4</name>
               <description>System Clock Gating Control Register 4</description>
               <addressOffset>0x1034</addressOffset>
               <resetValue>0xE80008070</resetValue>
               <fields>
                  <field>
                     <name>EWM</name>
                     <description>External Watchdog Monitor Clock Gate Control\n
This bit controls the clock gate to the EWM module</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="EWM" > <name>MCG</name> <description>MCG Clock Gate Control.\n
This bit controls the clock gate to the MCG Module</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>OSC</name> <description>Oscillator (Mhz) Clock Gate Control\n
This bit controls the clock gate to the Oscillator(Mhz)</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>I2C0</name> <description>I2C0 Clock Gate Control\n
This bit controls the clock gate to the I2C0 module</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>I2C1</name> <description>I2C1 Clock Gate Control\n
This bit controls the clock gate to the I2C1 module</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>UART0</name> <description>UART0 Clock Gate Control\n
This bit controls the clock gate to the UART0 module</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>UART1</name> <description>UART1 Clock Gate Control\n
This bit controls the clock gate to the UART1 module</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>UART2</name> <description>UART 2 Clock Gate Control\n
This bit controls the clock gate to the UART2 module</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>UART3</name> <description>UART 3 Clock Gate Control\n
This bit controls the clock gate to the UART3 module</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>VREF</name> <description>VREF Clock Gate Control\n
This bit controls the clock gate to the VREF module</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>CMP0</name> <description>High Speed Comparator 0 Clock Gate Control.\n
This bit controls the clock gate to the CMP0 module</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>CMP1</name> <description>High Speed Comparator 1 Clock Gate Control.\n
This bit controls the clock gate to the CMP1 module</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>SPI0</name> <description>SPI0 Clock Gate Control\n
This bit controls the clock gate to the SPI0 module</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>SPI1</name> <description>SPI1 Clock Gate Control\n
This bit controls the clock gate to the SPI1 module</description> <bitOffset>22</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SCGC5</name>
               <description>System Clock Gating Control Register 5</description>
               <addressOffset>0x1038</addressOffset>
               <resetValue>0xB0000</resetValue>
               <fields>
                  <field>
                     <name>SLCD</name>
                     <description>Segmented LCD Clock Gate Control
This bit controls the clock gate to the SGLCD Module</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="SLCD" > <name>PORTA</name> <description>Port A Clock Gate Control</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>PORTB</name> <description>Port B Clock Gate Control</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>PORTC</name> <description>Port C Clock Gate Control</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>PORTD</name> <description>Port D Clock Gate Control</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>PORTE</name> <description>Port E Clock Gate Control</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>PORTF</name> <description>Port F Clock Gate Control</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>PORTG</name> <description>Port G Clock Gate Control</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>PORTH</name> <description>Port H Clock Gate Control</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>PORTI</name> <description>Port I Clock Gate Control</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>IRTC</name> <description>IRTC Clock Gate Control
This bit controls the clock gate to the IRTC Module</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>IRTCREGFILE</name> <description>IRTC_REG_FILE Clock Gate Control
This bit controls the clock gate to the IRTC_REG_FILE</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>WDOG</name> <description>Watchdog Clock Gate Control
This bit controls the clock gate to the WatchDog Module</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>XBAR</name> <description>Peripheral Crossbar Clock Gate Control
This bit controls the clock gate to the XBAR Module</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>TMR0</name> <description>Quadtimer0 Clock Gate Control
This bit controls the clock gate to the QTMR0</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>TMR1</name> <description>Quadtimer1 Clock Gate Control
This bit controls the clock gate to the QTMR1</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>TMR2</name> <description>Quadtimer2 Clock Gate Control
This bit controls the clock gate to the QTMR2</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="SLCD" > <name>TMR3</name> <description>Quadtimer3 Clock Gate Control
This bit controls the clock gate to the QTMR3</description> <bitOffset>26</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SCGC6</name>
               <description>System Clock Gating Control Register 6</description>
               <addressOffset>0x103C</addressOffset>
               <resetValue>0xC0000001</resetValue>
               <fields>
                  <field>
                     <name>FTFA</name>
                     <description>FTFA Clock Gate Control\n
This bit controls the clock gate to the FTFA Module</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FTFA" > <name>DMAMUX0</name> <description>DMA Mux 0 Clock Gate Control</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="FTFA" > <name>DMAMUX1</name> <description>DMA Mux 1 Clock Gate Control</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="FTFA" > <name>DMAMUX2</name> <description>DMA Mux 2 Clock Gate Control</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="FTFA" > <name>DMAMUX3</name> <description>DMA Mux 3 Clock Gate Control</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="FTFA" > <name>RNGA</name> <description>RNGA Clock Gate Control\n
This bit controls the clock gate to the RNGA Module</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="FTFA" > <name>ADC</name> <description>SAR ADC Clock Gate Control\n
This bit controls the clock gate to the SAR ADC Module</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="FTFA" > <name>PIT0</name> <description>PIT0 Clock Gate Control</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="FTFA" > <name>PIT1</name> <description>PIT1 Clock Gate Control</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="FTFA" > <name>AFE</name> <description>AFE Clock Gate Control\n
This bit controls the clock to all four AFE channels</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="FTFA" > <name>CRC</name> <description>Programmable CRC Clock Gate Control
This bit controls the clock gate to the PCRC Module</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="FTFA" > <name>LPTMR</name> <description>LPTMR Clock Gate Control
This bit controls the clock gate to the LPTMR Module</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="FTFA" > <name>SIM_LP</name> <description>SIM_LP Clock Gate Control\n
This bit controls the clock gate to the SIM Low Power logic</description> <bitOffset>30</bitOffset> </field>
                  <field>
                     <name>SIM_HP</name>
                     <description>SIM_HP Clock Gate Control
This bit controls the clock gate to the SIM High Power Logic</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock is always enabled to SIM</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
