podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SIM_MKM33ZA5.svd.xml
            <register>
               <name>MISC_CTL</name>
               <description>Miscellaneous Control Register</description>
               <addressOffset>0x106C</addressOffset>
               <resetValue>0x80000000</resetValue>
               <fields>
                  <field>
                     <name>XBARAFEMODOUTSEL</name>
                     <description>XBAR AFE Modulator Output Select\n
This field selects modulator data output of the respective AFE channel to drive XBAR_IN[3]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Sigma Delta Modulator 0 data output</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Sigma Delta Modulator 1 data output</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Sigma Delta Modulator 2 data output</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Sigma Delta Modulator 3 data output</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMADONESEL</name>
                     <description>DMA Done select\n
This field can be used to select the DMA Done flag to drive XBAR_IN[32]</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>DMA0</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>DMA1</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>DMA2</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>DMA3</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AFECLKSEL</name>
                     <description>AFE Clock Source Select\n
Selects between PLL, FLL and OSC clock as the source for the PLL clock branch for AFE Clock Mux</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>MCG PLL Clock selected</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>MCG FLL Clock selected</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>OSC Clock selected</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Disabled</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AFECLKPADDIR</name>
                     <description>AFE Clock Pad Direction
Controls the direction of the AFE CLK pin</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>AFE CLK PAD is input</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>AFE CLK PAD is output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UARTMODTYPE</name>
                     <description>UART Modulation Type\n
Selects between TypeA and TypeB modulation for IRDA support</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>TypeA (ORed) Modulation selected for IRDA</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>TypeB (ANDed) Modulation selected for IRDA</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART0IRSEL</name>
                     <description>UART0 IRDA Select\n
Exclusive selection with other UARTs. Do not select while another UART is selected for the same
functionality</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pad RX input (PTD[0] or PTF[3], as selected in Pinmux control) selected for RX input of
UART0 and UART0 TX signal is not used for modulation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>UART0 selected for IRDA modulation. UART0 TX modulated by XBAR_OUT[14] and UART0
RX input connected to XBAR_OUT[13]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART1IRSEL</name>
                     <description>UART1 IRDA Select\n
Exclusive selection with other UARTs. Do not select while another UART is selected for the same
functionality</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pad RX input (PTD[2] or PTI[0], as selected in Pinmux control) selected for RX input of UART1
and UART1 TX signal is not used for modulation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>UART1 selected for IRDA modulation. UART1 TX modulated by XBAR_OUT[14] and UART1
RX input connected to XBAR_OUT[13]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART2IRSEL</name>
                     <description>UART2 IRDA Select\n
Exclusive selection with other UARTs. Do not select while another UART is selected for the same
functionality</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pad RX input PTE[6] selected for RX input of UART2 and UART2 TX signal is not used for
modulation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>UART2 selected for IRDA modulation. UART2 TX modulated by XBAR_OUT[14] and UART2
RX input connected to XBAR_OUT[13]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART3IRSEL</name>
                     <description>UART3 IRDA Select\n
Exclusive selection with other UARTs. Do not select while another UART is selected for the same
functionality</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pad RX input (PTC[3] or PTD[7], as selected in Pinmux control) selected for RX input of
UART3 and UART3 TX signal is not used for modulation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>UART3 selected for IRDA modulation. UART3 TX modulated by XBAR_OUT[14] and UART3
RX input connected to XBAR_OUT[13]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>XBARPITOUTSEL</name>
                     <description>XBAR PIT Output select
This field selects PIT timer and timer channel to drive XBAR_IN[16]</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>PIT0[0] (default)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>PIT0[1]</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>PIT1[0]</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>PIT1[1]</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EWMINSEL</name>
                     <description>External Watchdog Monitor Input Select\n
This field is used to select input for external watchdog monitor</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Input from PAD (PTE[2] or PTE[4] as selected from Pinmux control )</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Peripheral Crossbar (XBAR) Output[32]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TMR0PLLCLKSEL</name>
                     <description>Timer CH0 PLL clock select</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Selects Bus Clock as source for the Timer CH0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Selects the PLL_AFE clock as the source for Timer CH0. The PLL_AFE clock source is itself
selected using the MISC_CTL[5:4]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TMR0SCSSEL</name>
                     <description>Quadtimer Channel0 Secondary Count Source Select\n
This field is used to select secondary count input source for Quadtimer Channel0. Configure
TMR_0_CTRL_SCS = 00b to route selected secondary source to the timer Channel0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pad PTF1 or PTD5, depending upon PCTL configuration</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Peripheral Crossbar (XBAR) Output[5]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TMR1SCSSEL</name>
                     <description>Quadtimer Channel1 Secondary Count Source Select\n
This field is used to select secondary count input source for Quadtimer Channel1. Configure
TMR_1_CTRL_SCS = 01b to route selected secondary source to the timer Channel1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pad PTG0 or PTC6, depending upon PCTL configuration</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Peripheral Crossbar (XBAR) Output[6]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TMR2SCSSEL</name>
                     <description>Quadtimer Channel2 Secondary Count Source Select\n
This field is used to select secondary count input source for Quadtimer Channel2. Configure
TMR_2_CTRL_SCS = 10b to route selected secondary source to the timer Channel2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pad PTF7 or PTF0, depending upon PCTL configuration</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Peripheral Crossbar (XBAR) Output[7]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TMR3SCSSEL</name>
                     <description>Quadtimer Channel3 Secondary Count Source Select\n
This field is used to select secondary count input source for Quadtimer Channel3. Configure
TMR_3_CTRL_SCS = 11b to route selected secondary source to the timer Channel3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pad PTE5 or PTD1, depending upon PCTL configuration</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Peripheral Crossbar (XBAR) Output[8]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TMR0PCSSEL</name>
                     <description>Quadtimer Channel0 Primary Count Source Select\n
This is used to select primary count source (clock) for Quadtimer Channel0. Configure
TMR_0_CTRL_PCS = 1xxxb to route selected primary clock source to the timer Channel0</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Bus Clock</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Peripheral Crossbar Output [9]</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Peripheral Crossbar Output [10]</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Disabled</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TMR0PCSSEL" > <name>TMR1PCSSEL</name> <description>Quadtimer Channel1 Primary Count Source Select\n
This is used to select primary count source (clock) for Quadtimer Channel1. Configure
TMR_1_CTRL_PCS = 1xxxb to route selected primary clock source to the timer Channel1</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="TMR0PCSSEL" > <name>TMR2PCSSEL</name> <description>Quadtimer Channel2 Primary Count Source Select\n
This is used to select primary count source (clock) for Quadtimer Channel2. Configure
TMR_2_CTRL_PCS = 1xxxb to route selected primary clock source to the timer Channel2</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="TMR0PCSSEL" > <name>TMR3PCSSEL</name> <description>Quadtimer Channel3 Primary Count Source Select\n
This is used to select primary count source (clock) for Quadtimer Channel3. Configure
TMR_3_CTRL_PCS = 1xxxb to route selected primary clock source to the timer Channel3</description> <bitOffset>26</bitOffset> </field>
                  <field>
                     <name>RTCCLKSEL</name>
                     <description>RTC Clock select\n
Selects between 32K IRC and OSC_32K clk for RTC operation</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>RTC OSC_32K clock selected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>32K IRC Clock selected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VREFBUFOUTEN</name>
                     <description>VrefBuffer Output Enable\n
Operates switch in VrefBuffer to enable the internal 1.2v reference to be driven to VREF pad</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Buffer does not drive PAD</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Buffer drives selected voltage (selected by vref_buffer_sel) on pad</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VREFBUFINSEL</name>
                     <description>VrefBuffer Input Select\n
Selects Between Internal 1.2v reference and external reference for SAR and DAC</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Internal Reference selected as Buffer Input</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>External Reference selected as Buffer Input</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VREFBUFPD</name>
                     <description>VrefBuffer Power Down\n
Powers down VrefBuffer when set</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Buffer Enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Buffer Powered Down</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
